In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('track_basic.csv')

In [3]:
df.head(10)

                             title  artist duration_ms
0            The Ghost of Tom Joad     813      263000
1                    Five Man Army       4      364306
2                    Five Man Army       4      364306
3                    Five Man Army       4      364306
4                    Five Man Army       4      364306
5                    Five Man Army       4      364306
6  Be Thankful for What You've Got       4      249693
7  Be Thankful for What You've Got       4      249693
8  Be Thankful for What You've Got       4      249693
9  Be Thankful for What You've Got       4      249693

In [4]:
uniques = df.drop_duplicates(subset=['title', 'artist'])

In [5]:
uniques

,title,artist,duration_ms
0,The Ghost of Tom Joad,813,263000
1,Five Man Army,4,364306
6,Be Thankful for What You've Got,4,249693
11,Straight Time,813,205000
12,Hymn of the Big Wheel,4,397226
...,...,...,...
33677265,Представление,1969257,\N
33677266,Стоп! Ночь,1969257,\N
33677274,Zolang je bij mij bent,82099,\N
33677282,Daar zijn we vrienden voor,82099,\N
33677286,Medley: Ik geef je een roosje / Sjakie / Ome Arie,82099,\N

In [8]:
uniques.to_csv('unique_tracks.csv')

In [6]:
with open("artist_credit", "r") as myfile, open('artist_basic.csv','w') as fw:
    fw.write('id,artist,created\n')
    for line in myfile:
        split_line = line.split('\t')
        id = split_line[0]
        artist = split_line[1].replace('"', "")
        created = split_line[4][0:4]
        
        text = id + ',' + '"' + artist + '",' + created + '\n'
        fw.write(text)

In [2]:
artists = pd.read_csv('artist_basic.csv')

In [3]:
artists.head(10)

        id                                artist  created
0   202094                            Ani & Beau     2011
1   485926                    The Ascient Rebels     2011
2  1009634  Charlie Parker feat. Dizzy Gillespie     2012
3   548770                            Dead Blood     2011
4   322256                           Dr. Kreator     2011
5   539393             Rappa Roberts & Tippa Lee     2011
6   670745                              Nonsense     2011
7   961437                                   김한성     2012
8  1167652         Saskia Tanfal & Marius Clarén     2013
9   797484                      Sergeant Juggler     2011

In [11]:
uniques.head(10)

                              title  artist duration_ms  year
0             The Ghost of Tom Joad     813      263000  none
1                     Five Man Army       4      364306  none
6   Be Thankful for What You've Got       4      249693  none
11                    Straight Time     813      205000  none
12            Hymn of the Big Wheel       4      397226  none
17                       Highway 29     813      219000  none
18                           Lately       4      266493  none
23                       Youngstown     813      232000  none
24              Unfinished Sympathy       4      308293  none
29      Flight of the Passing Fancy      11      232266  none

In [4]:
uniques = pd.read_csv('unique_tracks.csv')

In [7]:
merged = uniques.merge(artists, left_on='artist', right_on='id')

In [9]:
del merged['artist_x']

In [10]:
merged

,Unnamed: 0,title,duration_ms,id,artist_y,created
0,0,The Ghost of Tom Joad,263000,813,Bruce Springsteen,2011
1,11,Straight Time,205000,813,Bruce Springsteen,2011
2,17,Highway 29,219000,813,Bruce Springsteen,2011
3,23,Youngstown,232000,813,Bruce Springsteen,2011
4,58,Sinaloa Cowboys,231000,813,Bruce Springsteen,2011
...,...,...,...,...,...,...
20785940,33677104,Never Was Love,274900,2934598,Russ Long,2021
20785941,33677105,Mellow Out,263400,2934599,Pacific Dreams,2021
20785942,33677106,Key To My Heart,157300,2934600,"Miller, Miller, Miller & Sloan",2021
20785943,33677107,Blues Take You Over,214897,2934601,Scott Cunningham,2021
20785944,33677175,Don't Leave Tonight,231000,2934602,Conny Vandenbos & Janis Ian,2021

In [12]:
del merged['Unnamed: 0']

In [13]:
del merged['id']

In [14]:
merged

,title,duration_ms,artist_y,created
0,The Ghost of Tom Joad,263000,Bruce Springsteen,2011
1,Straight Time,205000,Bruce Springsteen,2011
2,Highway 29,219000,Bruce Springsteen,2011
3,Youngstown,232000,Bruce Springsteen,2011
4,Sinaloa Cowboys,231000,Bruce Springsteen,2011
...,...,...,...,...
20785940,Never Was Love,274900,Russ Long,2021
20785941,Mellow Out,263400,Pacific Dreams,2021
20785942,Key To My Heart,157300,"Miller, Miller, Miller & Sloan",2021
20785943,Blues Take You Over,214897,Scott Cunningham,2021
20785944,Don't Leave Tonight,231000,Conny Vandenbos & Janis Ian,2021

In [ ]:
merged.columns = ['title', 'duration_ms', 'artist', 'release_year']

In [23]:
merged

,title,duration_ms,artist,release_year
0,The Ghost of Tom Joad,263000,Bruce Springsteen,2011
1,Straight Time,205000,Bruce Springsteen,2011
2,Highway 29,219000,Bruce Springsteen,2011
3,Youngstown,232000,Bruce Springsteen,2011
4,Sinaloa Cowboys,231000,Bruce Springsteen,2011
...,...,...,...,...
20785940,Never Was Love,274900,Russ Long,2021
20785941,Mellow Out,263400,Pacific Dreams,2021
20785942,Key To My Heart,157300,"Miller, Miller, Miller & Sloan",2021
20785943,Blues Take You Over,214897,Scott Cunningham,2021
20785944,Don't Leave Tonight,231000,Conny Vandenbos & Janis Ian,2021

In [26]:
merged.to_csv('final_merged.csv')